# SpotCoordinateTopPrefix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotCoordinateTopPrefix Property
ParameterTypeId Class See Also
---
"Top Coordinate Prefix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotCoordinateTopPrefix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotCoordinateTopPrefix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotCoordinateTopPrefix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace